backend/app/controllers/report_types_controller.rb

  def index
    report_types = ReportType.all
---
SELECT "report_types".* FROM "report_types"