backend/app/controllers/reports_controller.rb

SELECT "reports".* FROM "reports"
---
  def index
    @reports = Report.all

SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    report = Report.find_by!(id: params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def user_reports
    user = User.find_by!(id: params[:user_id])