backend/app/controllers/users_controller.rb

    def signup
        @user=User.new(permited_params)
        if @user.save
---
INSERT INTO "users" ("first_name", "surname", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def login
        @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "peter@gmail.com"], ["LIMIT", 1]]